layer {
  name: "srcImg"
  type: "Python"
  top: "srcImg"
  top: "tgtImg"
  top: "auxImg"
  top: "srcTform"
  top: "auxTform"
  python_param {
    module: "python_layers"
    layer: "KittiTripletSamplerEuler"
    param_str: "{\'seq_ids\': range(0, 9), \'batch_size\': 10, \'poseDir\': \'/data/fast/tinghuiz/kitti_synth/poses/\', \'seqDir\': \'/data/fast/tinghuiz/kitti_synth/sequences_224/\'}"
  }
}
layer {
  name: "gxy"
  type: "Python"
  top: "gxy"
  python_param {
    module: "python_layers"
    layer: "Meshgrid"
    param_str: "{\'height\': 224, \'batch\': 10, \'width\': 224}"
  }
}
layer {
  name: "Transformation1"
  type: "Transformation"
  bottom: "srcImg"
  top: "Transformation1"
  transform_param {
    mean_value: 116.060394287
    mean_value: 113.741088867
    mean_value: 105.487823486
  }
}
layer {
  name: "Concat1"
  type: "Concat"
  bottom: "Transformation1"
  bottom: "srcTform"
  top: "Concat1"
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "Concat1"
  top: "Convolution1"
  param {
    name: "conv0_w"
  }
  param {
    name: "conv0_b"
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "Convolution1"
  top: "Convolution2"
  param {
    name: "conv1_w"
  }
  param {
    name: "conv1_b"
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "Convolution2"
  top: "Convolution2"
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "Convolution2"
  top: "Convolution3"
  param {
    name: "conv2_w"
  }
  param {
    name: "conv2_b"
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Convolution3"
  top: "Convolution4"
  param {
    name: "conv3_w"
  }
  param {
    name: "conv3_b"
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  param {
    name: "conv4_w"
  }
  param {
    name: "conv4_b"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "Convolution5"
  top: "Convolution5"
}
layer {
  name: "Convolution6"
  type: "Convolution"
  bottom: "Convolution5"
  top: "Convolution6"
  param {
    name: "conv5_w"
  }
  param {
    name: "conv5_b"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "srcFeat"
  type: "ReLU"
  bottom: "Convolution6"
  top: "Convolution6"
}
layer {
  name: "Transformation2"
  type: "Transformation"
  bottom: "auxImg"
  top: "Transformation2"
  transform_param {
    mean_value: 116.060394287
    mean_value: 113.741088867
    mean_value: 105.487823486
  }
}
layer {
  name: "Concat2"
  type: "Concat"
  bottom: "Transformation2"
  bottom: "auxTform"
  top: "Concat2"
}
layer {
  name: "Convolution7"
  type: "Convolution"
  bottom: "Concat2"
  top: "Convolution7"
  param {
    name: "conv0_w"
  }
  param {
    name: "conv0_b"
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "Convolution7"
  top: "Convolution7"
}
layer {
  name: "Convolution8"
  type: "Convolution"
  bottom: "Convolution7"
  top: "Convolution8"
  param {
    name: "conv1_w"
  }
  param {
    name: "conv1_b"
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "Convolution8"
  top: "Convolution8"
}
layer {
  name: "Convolution9"
  type: "Convolution"
  bottom: "Convolution8"
  top: "Convolution9"
  param {
    name: "conv2_w"
  }
  param {
    name: "conv2_b"
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "Convolution9"
  top: "Convolution9"
}
layer {
  name: "Convolution10"
  type: "Convolution"
  bottom: "Convolution9"
  top: "Convolution10"
  param {
    name: "conv3_w"
  }
  param {
    name: "conv3_b"
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "Convolution10"
  top: "Convolution10"
}
layer {
  name: "Convolution11"
  type: "Convolution"
  bottom: "Convolution10"
  top: "Convolution11"
  param {
    name: "conv4_w"
  }
  param {
    name: "conv4_b"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "Convolution11"
  top: "Convolution11"
}
layer {
  name: "Convolution12"
  type: "Convolution"
  bottom: "Convolution11"
  top: "Convolution12"
  param {
    name: "conv5_w"
  }
  param {
    name: "conv5_b"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "auxFeat"
  type: "ReLU"
  bottom: "Convolution12"
  top: "Convolution12"
}
layer {
  name: "Deconvolution1"
  type: "Deconvolution"
  bottom: "Convolution6"
  top: "Deconvolution1"
  param {
    name: "deconv9_w"
  }
  param {
    name: "deconv9_b"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "Deconvolution1"
  top: "Deconvolution1"
}
layer {
  name: "Deconvolution2"
  type: "Deconvolution"
  bottom: "Deconvolution1"
  top: "Deconvolution2"
  param {
    name: "deconv10_w"
  }
  param {
    name: "deconv10_b"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "Deconvolution2"
  top: "Deconvolution2"
}
layer {
  name: "Deconvolution3"
  type: "Deconvolution"
  bottom: "Deconvolution2"
  top: "Deconvolution3"
  param {
    name: "deconv11_w"
  }
  param {
    name: "deconv11_b"
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "Deconvolution3"
  top: "Deconvolution3"
}
layer {
  name: "Deconvolution4"
  type: "Deconvolution"
  bottom: "Deconvolution3"
  top: "Deconvolution4"
  param {
    name: "deconv12_w"
  }
  param {
    name: "deconv12_b"
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "Deconvolution4"
  top: "Deconvolution4"
}
layer {
  name: "Deconvolution5"
  type: "Deconvolution"
  bottom: "Deconvolution4"
  top: "Deconvolution5"
  param {
    name: "deconv13_w"
  }
  param {
    name: "deconv13_b"
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU15"
  type: "ReLU"
  bottom: "Deconvolution5"
  top: "Deconvolution5"
}
layer {
  name: "Deconvolution6"
  type: "Deconvolution"
  bottom: "Deconvolution5"
  top: "Deconvolution6"
  param {
    name: "deconv14_w"
  }
  param {
    name: "deconv14_b"
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU16"
  type: "ReLU"
  bottom: "Deconvolution6"
  top: "Deconvolution6"
}
layer {
  name: "Deconvolution7"
  type: "Deconvolution"
  bottom: "Deconvolution6"
  top: "Deconvolution7"
  param {
    name: "deconv15_w"
  }
  param {
    name: "deconv15_b"
  }
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "Resize1"
  type: "Resize"
  bottom: "Deconvolution7"
  top: "Resize1"
  resize_param {
    height: 224
    width: 224
  }
}
layer {
  name: "srcPredFlow"
  type: "Slice"
  bottom: "Resize1"
  top: "srcPredFlow"
  top: "srcConf"
  slice_param {
    slice_point: 2
  }
}
layer {
  name: "Eltwise1"
  type: "Eltwise"
  bottom: "srcPredFlow"
  bottom: "gxy"
  top: "Eltwise1"
  eltwise_param {
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "srcPredImg"
  type: "Remap"
  bottom: "srcImg"
  bottom: "Eltwise1"
  top: "srcPredImg"
}
layer {
  name: "Deconvolution8"
  type: "Deconvolution"
  bottom: "Convolution12"
  top: "Deconvolution8"
  param {
    name: "deconv9_w"
  }
  param {
    name: "deconv9_b"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU17"
  type: "ReLU"
  bottom: "Deconvolution8"
  top: "Deconvolution8"
}
layer {
  name: "Deconvolution9"
  type: "Deconvolution"
  bottom: "Deconvolution8"
  top: "Deconvolution9"
  param {
    name: "deconv10_w"
  }
  param {
    name: "deconv10_b"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU18"
  type: "ReLU"
  bottom: "Deconvolution9"
  top: "Deconvolution9"
}
layer {
  name: "Deconvolution10"
  type: "Deconvolution"
  bottom: "Deconvolution9"
  top: "Deconvolution10"
  param {
    name: "deconv11_w"
  }
  param {
    name: "deconv11_b"
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU19"
  type: "ReLU"
  bottom: "Deconvolution10"
  top: "Deconvolution10"
}
layer {
  name: "Deconvolution11"
  type: "Deconvolution"
  bottom: "Deconvolution10"
  top: "Deconvolution11"
  param {
    name: "deconv12_w"
  }
  param {
    name: "deconv12_b"
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU20"
  type: "ReLU"
  bottom: "Deconvolution11"
  top: "Deconvolution11"
}
layer {
  name: "Deconvolution12"
  type: "Deconvolution"
  bottom: "Deconvolution11"
  top: "Deconvolution12"
  param {
    name: "deconv13_w"
  }
  param {
    name: "deconv13_b"
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU21"
  type: "ReLU"
  bottom: "Deconvolution12"
  top: "Deconvolution12"
}
layer {
  name: "Deconvolution13"
  type: "Deconvolution"
  bottom: "Deconvolution12"
  top: "Deconvolution13"
  param {
    name: "deconv14_w"
  }
  param {
    name: "deconv14_b"
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ReLU22"
  type: "ReLU"
  bottom: "Deconvolution13"
  top: "Deconvolution13"
}
layer {
  name: "Deconvolution14"
  type: "Deconvolution"
  bottom: "Deconvolution13"
  top: "Deconvolution14"
  param {
    name: "deconv15_w"
  }
  param {
    name: "deconv15_b"
  }
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "Resize2"
  type: "Resize"
  bottom: "Deconvolution14"
  top: "Resize2"
  resize_param {
    height: 224
    width: 224
  }
}
layer {
  name: "auxPredFlow"
  type: "Slice"
  bottom: "Resize2"
  top: "auxPredFlow"
  top: "auxConf"
  slice_param {
    slice_point: 2
  }
}
layer {
  name: "Eltwise2"
  type: "Eltwise"
  bottom: "auxPredFlow"
  bottom: "gxy"
  top: "Eltwise2"
  eltwise_param {
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "auxPredImg"
  type: "Remap"
  bottom: "auxImg"
  bottom: "Eltwise2"
  top: "auxPredImg"
}
layer {
  name: "Concat3"
  type: "Concat"
  bottom: "srcConf"
  bottom: "auxConf"
  top: "Concat3"
}
layer {
  name: "confAll"
  type: "Softmax"
  bottom: "Concat3"
  top: "confAll"
}
layer {
  name: "srcSelect"
  type: "Slice"
  bottom: "confAll"
  top: "srcSelect"
  top: "auxSelect"
  slice_param {
    slice_point: 1
  }
}
layer {
  name: "Concat4"
  type: "Concat"
  bottom: "srcSelect"
  bottom: "srcSelect"
  bottom: "srcSelect"
  top: "Concat4"
}
layer {
  name: "srcSelectPred"
  type: "Eltwise"
  bottom: "srcPredImg"
  bottom: "Concat4"
  top: "srcSelectPred"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Concat5"
  type: "Concat"
  bottom: "auxSelect"
  bottom: "auxSelect"
  bottom: "auxSelect"
  top: "Concat5"
}
layer {
  name: "auxSelectPred"
  type: "Eltwise"
  bottom: "auxPredImg"
  bottom: "Concat5"
  top: "auxSelectPred"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "predImg"
  type: "Eltwise"
  bottom: "srcSelectPred"
  bottom: "auxSelectPred"
  top: "predImg"
  eltwise_param {
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "imgLoss"
  type: "Python"
  bottom: "predImg"
  bottom: "tgtImg"
  top: "imgLoss"
  loss_weight: 1.0
  python_param {
    module: "python_layers"
    layer: "MaskedL1Loss"
  }
}
layer {
  name: "imgLoss_src"
  type: "Python"
  bottom: "srcPredImg"
  bottom: "tgtImg"
  top: "imgLoss_src"
  loss_weight: 0.1
  python_param {
    module: "python_layers"
    layer: "MaskedL1Loss"
  }
}
layer {
  name: "imgLoss_aux"
  type: "Python"
  bottom: "auxPredImg"
  bottom: "tgtImg"
  top: "imgLoss_aux"
  loss_weight: 0.1
  python_param {
    module: "python_layers"
    layer: "MaskedL1Loss"
  }
}
