layer {
  name: "srcImg"
  type: "Python"
  top: "srcImg"
  top: "tgtImg"
  top: "tform"
  python_param {
    module: "python_layers"
    layer: "KittiSamplerEuler"
    param_str: "{\'seqDir\': \'/data/fast/tinghuiz/kitti_synth/sequences_224/\', \'batch_size\': 10, \'seq_ids\': range(0, 9), \'poseDir\': \'/data/fast/tinghuiz/kitti_synth/poses/\'}"
  }
}
layer {
  name: "gxy"
  type: "Python"
  top: "gxy"
  python_param {
    module: "python_layers"
    layer: "Meshgrid"
    param_str: "{\'batch\': 10, \'height\': 224, \'width\': 224}"
  }
}
layer {
  name: "mean"
  type: "Python"
  top: "mean"
  python_param {
    module: "python_layers"
    layer: "MeanVals"
    param_str: "{\'batch\': 10, \'height\': 224, \'width\': 224}"
  }
}
layer {
  name: "srcImg_t"
  type: "Eltwise"
  bottom: "srcImg"
  bottom: "mean"
  top: "srcImg_t"
  eltwise_param {
    coeff: 1
    coeff: -1
  }
}
layer {
  name: "input_stack"
  type: "Concat"
  bottom: "srcImg_t"
  bottom: "tform"
  top: "input_stack"
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "input_stack"
  top: "Convolution1"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv0"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "Convolution1"
  top: "Convolution2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv1"
  type: "ReLU"
  bottom: "Convolution2"
  top: "Convolution2"
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "Convolution2"
  top: "Convolution3"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Convolution3"
  top: "Convolution4"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4"
  type: "ReLU"
  bottom: "Convolution5"
  top: "Convolution5"
}
layer {
  name: "Deconvolution1"
  type: "Deconvolution"
  bottom: "Convolution5"
  top: "Deconvolution1"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "flow_deconv10"
  type: "ReLU"
  bottom: "Deconvolution1"
  top: "Deconvolution1"
}
layer {
  name: "Deconvolution2"
  type: "Deconvolution"
  bottom: "Deconvolution1"
  top: "Deconvolution2"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "flow_deconv11"
  type: "ReLU"
  bottom: "Deconvolution2"
  top: "Deconvolution2"
}
layer {
  name: "Deconvolution3"
  type: "Deconvolution"
  bottom: "Deconvolution2"
  top: "Deconvolution3"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "flow_deconv12"
  type: "ReLU"
  bottom: "Deconvolution3"
  top: "Deconvolution3"
}
layer {
  name: "Deconvolution4"
  type: "Deconvolution"
  bottom: "Deconvolution3"
  top: "Deconvolution4"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "flow_deconv13"
  type: "ReLU"
  bottom: "Deconvolution4"
  top: "Deconvolution4"
}
layer {
  name: "Deconvolution5"
  type: "Deconvolution"
  bottom: "Deconvolution4"
  top: "Deconvolution5"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "flow_deconv14"
  type: "ReLU"
  bottom: "Deconvolution5"
  top: "Deconvolution5"
}
layer {
  name: "flow_deconv15"
  type: "Deconvolution"
  bottom: "Deconvolution5"
  top: "flow_deconv15"
  convolution_param {
    num_output: 2
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "flow"
  type: "Resize"
  bottom: "flow_deconv15"
  top: "flow"
  resize_param {
    height: 224
    width: 224
  }
}
layer {
  name: "coords"
  type: "Eltwise"
  bottom: "flow"
  bottom: "gxy"
  top: "coords"
  eltwise_param {
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "predImg"
  type: "Remap"
  bottom: "srcImg"
  bottom: "coords"
  top: "predImg"
}
layer {
  name: "imgLoss"
  type: "Python"
  bottom: "predImg"
  bottom: "tgtImg"
  top: "imgLoss"
  loss_weight: 1.0
  python_param {
    module: "python_layers"
    layer: "MaskedL1Loss"
  }
}
